// 1) Даний об'єкт з містами та країнами. Вивести масив значення в якому будуть рядки перетворені на цей формат: <Столиця> - це <Країна>.

const countries = {
    'Ukraine': 'Kyiv',
    'Poland': 'Warsaw',
    'Lithuania': 'Vilnius',
    'Latvia': 'Riga',
    'Estonia': 'Riga'
}
for(let key in countries){
  console.log(countries[key] + ' - це ' + key)
}


// 2) Створити функцію яка виведе багатовимірний масив A. Даний масив містить список інших масивів B. Масиви B повинні містити по 3 значення. Та вивести його максимальне значення
let a = 0
let arr = [
    [321, 545, 323],
    [4234, 123, 342], 
    [453, 121, 222]
];
for(let value of arr){
  for(let val of value){
    if(val>a){
      a=val
    }  
  }

}
console.log(a)



// 3) Створити об'єкт із назвами днів тижня. Де ключами будуть uk і en, a значенням властивості uk буде масив із назвами днів тижня українською, а en - англійською. Після написати функцію яка буде виводити в консоль назву дня тижня, користуючись вище створеним об'єктом. Усі дні тижня починаються з 1 і закінчуються цифрою 7 (1- понеділок, 7 - неділя). Функція отримує змінну lang – назву мови дня тижня та змінну day – число дня тижня.

// 4) Створіть функцію, яка повертає суму двох найменших позитивних чисел із масиву мінімум 4 позитивних цілих чисел. Не передаються числа з плаваючою комою або непозитивні цілі числа.

// 5) Даний масив одиниць і нулів, перетворіть еквівалентне двійкове значення ціле число.
// Наприклад: [0, 0, 0, 1] розглядається як 0001 двійкове уявлення 1.